In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('module2-sql-for-analysis/titanic.csv')
df.Name = df.Name.replace("'", '', regex=True)

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [4]:
df.shape

(887, 8)

In [5]:
import psycopg2

In [7]:
pg_conn = psycopg2.connect(database=dbname, user=user, password=password, host=host)

In [8]:
pg_conn

In [9]:
import sqlite3

In [10]:
sl_conn = sqlite3.connect('module2-sql-for-analysis/titanic.sqlite3')

In [11]:
df.to_sql('titanic_set2',con=sl_conn,if_exists='replace')

/Users/timothy/miniconda3/lib/python3.7/site-packages/pandas/core/generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [12]:
sl_curs = sl_conn.cursor()

In [13]:
sl_curs.execute('SELECT COUNT(*) FROM titanic_set2;').fetchall()

[(887,)]

In [14]:
sl_curs.execute('PRAGMA table_info(titanic_set2);').fetchall()

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'Survived', 'INTEGER', 0, None, 0),
 (2, 'Pclass', 'INTEGER', 0, None, 0),
 (3, 'Name', 'TEXT', 0, None, 0),
 (4, 'Sex', 'TEXT', 0, None, 0),
 (5, 'Age', 'REAL', 0, None, 0),
 (6, 'Siblings/Spouses Aboard', 'INTEGER', 0, None, 0),
 (7, 'Parents/Children Aboard', 'INTEGER', 0, None, 0),
 (8, 'Fare', 'REAL', 0, None, 0)]

In [15]:
create_titanic_table = """
  CREATE TABLE titanic_set2 (
    index SERIAL PRIMARY KEY,
    Survived INT,
    Pclass INT,
    Name TEXT,
    Sex sex,
    Age REAL,
    SiblingsSpousesAboard INT,
    ParentsChildrenAboard INT,
    Fare REAL
  );
"""

In [16]:
pg_curs = pg_conn.cursor()

In [17]:
pg_curs.execute('SELECT * FROM test_table;')

In [18]:
pg_curs.fetchall()

[(1, 'a row name', None),
 (2, 'a second row', {'a': 1, 'b': ['dog', 'cat', 42], 'c': True})]

In [ ]:
#pg_curs.execute("CREATE TYPE sex AS ENUM ('male', 'female');")

In [19]:
#pg_curs.execute("CREATE TYPE sex AS ENUM ('male', 'female');")

In [20]:
pg_curs.execute(create_titanic_table)

In [21]:
show_tables = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog'
AND schemaname != 'information_schema';
"""

In [22]:
pg_curs.execute(show_tables)

In [23]:
pg_curs.fetchall()

[('public', 'products', 'iexxnidb', None, True, False, False, False),
 ('public', 'test_table', 'onkcdgsp', None, True, False, False, False),
 ('public',
  'charactercreator_character',
  'onkcdgsp',
  None,
  True,
  False,
  False,
  False),
 ('public', 'titanic', 'onkcdgsp', None, True, False, False, False),
 ('public', 'titanic_set2', 'onkcdgsp', None, True, False, False, False)]

In [24]:
allData = sl_curs.execute('SELECT * from titanic_set2;').fetchall()

In [25]:
len(allData)

887

In [26]:
allData[0]

(0, 0, 3, 'Mr. Owen Harris Braund', 'male', 22.0, 1, 0, 7.25)

In [27]:
allData[-1]

(886, 0, 3, 'Mr. Patrick Dooley', 'male', 32.0, 0, 0, 7.75)

In [28]:
example_insert = """
INSERT INTO titanic_set2
(Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
VALUES """ + str(allData[1][1:]) + ';'

In [29]:
print(example_insert)

INSERT INTO titanic_set2
(Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
VALUES (1, 1, 'Mrs. John Bradley (Florence Briggs Thayer) Cumings', 'female', 38.0, 1, 0, 71.2833);

In [30]:
for theData in allData:
    insert_data="""
    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES """ + str(theData[1:]) + ';'
    print(insert_data)
    pg_curs.execute(insert_data)

UES (0, 1, 'Mr. Benjamin Guggenheim', 'male', 46.0, 0, 0, 79.2);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Andrew Keane', 'male', 20.0, 0, 0, 7.75);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Alfred Gaskell', 'male', 16.0, 0, 0, 26.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Stella Anna Sage', 'female', 21.0, 8, 2, 69.55);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 1, 'Mr. William Fisher Hoyt', 'male', 43.0, 0, 0, 30.6958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Ristiu Dantcheff', 'male', 25.0, 0, 0, 7.8958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Richard Otter', 'male', 39.0, 0, 0, 13.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Dr. Alice (Farnham) Leader', 'female', 49.0, 0, 0, 25.9292);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mrs. Mara Osman', 'female', 31.0, 0, 0, 8.6833);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Yousseff Ibrahim Shawah', 'male', 30.0, 0, 0, 7.2292);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mrs. Jean Baptiste (Rosalie Paula Govaert) Van Impe', 'female', 30.0, 1, 1, 24.15);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Martin Ponesell', 'male', 34.0, 0, 0, 13.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 2, 'Mrs. Harvey (Charlotte Annie Tate) Collyer', 'female', 31.0, 1, 1, 26.25);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Master. William Thornton II Carter', 'male', 11.0, 1, 2, 120.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Master. Assad Alexander Thomas', 'male', 0.42, 0, 1, 8.5167);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mr. Oskar Arvid Hedman', 'male', 27.0, 0, 0, 6.975);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Karl Johan Johansson', 'male', 31.0, 0, 0, 7.775);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 1, 'Mr. Thomas Jr Andrews', 'male', 39.0, 0, 0, 0.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Ellen Natalia Pettersson', 'female', 18.0, 0, 0, 7.775);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. August Meyer', 'male', 39.0, 0, 0, 13.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. Norman Campbell (Bertha Griggs) Chambers', 'female', 33.0, 1, 0, 53.1);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. William Alexander', 'male', 26.0, 0, 0, 7.8875);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. James Lester', 'male', 39.0, 0, 0, 24.15);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Richard James Slemen', 'male', 35.0, 0, 0, 10.5);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Ebba Iris Alfrida Andersson', 'female', 6.0, 4, 2, 31.275);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Ernest Portage Tomlin', 'male', 30.5, 0, 0, 8.05);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 1, 'Mr. Richard Fry', 'male', 39.0, 0, 0, 0.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Wendla Maria Heininen', 'female', 23.0, 0, 0, 7.925);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Albert Mallet', 'male', 31.0, 1, 1, 37.0042);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. John Fredrik Alexander Holm', 'male', 43.0, 0, 0, 6.45);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Master. Karl Thorsten Skoog', 'male', 10.0, 3, 2, 27.9);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. Charles Melville (Clara Jennings Gregg) Hays', 'female', 52.0, 1, 1, 93.5);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mr. Nikola Lulic', 'male', 27.0, 0, 0, 8.6625);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 1, 'Jonkheer. John George Reuchlin', 'male', 38.0, 0, 0, 0.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mrs. (Beila) Moor', 'female', 27.0, 0, 1, 12.475);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Master. Urho Abraham Panula', 'male', 2.0, 4, 1, 39.6875);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. John Flynn', 'male', 36.0, 0, 0, 6.95);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Len Lam', 'male', 23.0, 0, 0, 56.4958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 2, 'Master. Andre Mallet', 'male', 1.0, 0, 2, 37.0042);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mr. Thomas Joseph McCormack', 'male', 19.0, 0, 0, 7.75);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. George Nelson (Martha Evelyn) Stone', 'female', 62.0, 0, 0, 80.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mrs. Antoni (Selini Alexander) Yasbeck', 'female', 15.0, 1, 0, 14.4542);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 2, 'Master. George Sibley Richards', 'male', 0.83, 1, 1, 18.75);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Amin Saad', 'male', 30.0, 0, 0, 7.2292);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Albert Augustsson', 'male', 23.0, 0, 0, 7.8542);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Owen George Allum', 'male', 18.0, 0, 0, 8.3);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Miss. Sara Rebecca Compton', 'female', 39.0, 1, 1, 83.1583);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Jakob Pasic', 'male', 21.0, 0, 0, 8.6625);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Maurice Sirota', 'male', 20.0, 0, 0, 8.05);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mr. Chang Chip', 'male', 32.0, 0, 0, 56.4958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mr. Pierre Marechal', 'male', 29.0, 0, 0, 29.7);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Ilmari Rudolf Alhomaki', 'male', 20.0, 0, 0, 7.925);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Thomas Charles Mudd', 'male', 16.0, 0, 0, 10.5);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Miss. Augusta Serepeca', 'female', 30.0, 0, 0, 31.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Peter L Lemberopolous', 'male', 34.5, 0, 0, 6.4375);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Jeso Culumovic', 'male', 17.0, 0, 0, 8.6625);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Anthony Abbing', 'male', 42.0, 0, 0, 7.55);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Douglas Bullen Sage', 'male', 18.0, 8, 2, 69.55);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Marin Markoff', 'male', 35.0, 0, 0, 7.8958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Rev. John Harper', 'male', 28.0, 0, 1, 33.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. Samuel L (Edwiga Grabowska) Goldenberg', 'female', 40.0, 1, 0, 89.1042);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Master. Sigvard Harald Elias Andersson', 'male', 4.0, 4, 2, 31.275);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Johan Svensson', 'male', 74.0, 0, 0, 7.775);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Nourelain Boulos', 'female', 9.0, 1, 1, 15.2458);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Miss. Mary Conover Lines', 'female', 16.0, 0, 1, 39.4);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mrs. Ernest Courtenay (Lilian Hughes) Carter', 'female', 44.0, 1, 0, 26.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mrs. Sam (Leah Rosen) Aks', 'female', 18.0, 0, 1, 9.35);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. George Dennick (Mary Hitchcock) Wick', 'female', 45.0, 1, 1, 164.8667);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mr. Peter Denis Daly', 'male', 51.0, 0, 0, 26.55);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Mrs. Solomon (Latifa Qurban) Baclini', 'female', 24.0, 0, 3, 19.2583);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Raihed Razi', 'male', 30.0, 0, 0, 7.2292);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Claus Peter Hansen', 'male', 41.0, 2, 0, 14.1083);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Frederick Edward Giles', 'male', 21.0, 1, 0, 11.5);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. Frederick Joel (Margaret Welles Barron) Swift', 'female', 48.0, 0, 0, 25.9292);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Dorothy Edith Sage', 'female', 14.0, 8, 2, 69.55);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. John William Gill', 'male', 24.0, 0, 0, 13.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 2, 'Mrs. (Karolina) Bystrom', 'female', 42.0, 0, 0, 13.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 2, 'Miss. Asuncion Duran y More', 'female', 27.0, 1, 0, 13.8583);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 1, 'Mr. Washington Augustus II Roebling', 'male', 31.0, 0, 0, 50.4958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Philemon van Melkebeke', 'male', 23.0, 0, 0, 9.5);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Master. Harold Theodor Johnson', 'male', 4.0, 1, 1, 11.1333);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Cerin Balkic', 'male', 26.0, 0, 0, 7.8958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. Richard Leonard (Sallie Monypeny) Beckwith', 'female', 47.0, 1, 1, 52.5542);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 1, 'Mr. Frans Olof Carlsson', 'male', 33.0, 0, 0, 5.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Victor Vander Cruyssen', 'male', 47.0, 0, 0, 9.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 2, 'Mrs. Samuel (Hannah Wizosky) Abelson', 'female', 28.0, 1, 0, 24.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 3, 'Miss. Adele Kiamie Najib', 'female', 15.0, 0, 0, 7.225);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Alfred Ossian Gustafsson', 'male', 20.0, 0, 0, 9.8458);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Nedelio Petroff', 'male', 19.0, 0, 0, 7.8958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Kristo Laleff', 'male', 23.0, 0, 0, 7.8958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mrs. Thomas Jr (Lily Alexenia Wilson) Potter', 'female', 56.0, 0, 1, 83.1583);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 2, 'Mrs. William (Imanita Parrish Hall) Shelley', 'female', 25.0, 0, 1, 26.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Johann Markun', 'male', 33.0, 0, 0, 7.8958);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Gerda Ulrika Dahlberg', 'female', 22.0, 0, 0, 10.5167);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Mr. Frederick James Banfield', 'male', 28.0, 0, 0, 10.5);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Henry Jr Sutehall', 'male', 25.0, 0, 0, 7.05);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mrs. William (Margaret Norton) Rice', 'female', 39.0, 0, 5, 29.125);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 2, 'Rev. Juozas Montvila', 'male', 27.0, 0, 0, 13.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Miss. Margaret Edith Graham', 'female', 19.0, 0, 0, 30.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Miss. Catherine Helen Johnston', 'female', 7.0, 1, 2, 23.45);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (1, 1, 'Mr. Karl Howell Behr', 'male', 26.0, 0, 0, 30.0);

    INSERT INTO titanic_set2
    (Survived, Pclass, Name, Sex, Age, SiblingsSpousesAboard, ParentsChildrenAboard, Fare)
    VALUES (0, 3, 'Mr. Patrick Dooley', 'male', 32.0, 0, 0, 7.75);

In [31]:
pg_curs.execute('SELECT * FROM titanic_set2;')
pg_curs.fetchall()

,
 (614, 0, 3, 'Mr. Ernst Gilbert Danbom', 'male', 34.0, 1, 1, 14.4),
 (615,
  0,
  3,
  'Mrs. William Arthur (Cordelia K Stanlick) Lobb',
  'female',
  26.0,
  1,
  0,
  16.1),
 (616, 1, 2, 'Miss. Marion Louise Becker', 'female', 4.0, 2, 1, 39.0),
 (617, 0, 2, 'Mr. Lawrence Gavey', 'male', 26.0, 0, 0, 10.5),
 (618, 0, 3, 'Mr. Antoni Yasbeck', 'male', 27.0, 1, 0, 14.4542),
 (619, 1, 1, 'Mr. Edwin Nelson Jr Kimball', 'male', 42.0, 1, 0, 52.5542),
 (620, 1, 3, 'Mr. Sahid Nakid', 'male', 20.0, 1, 1, 15.7417),
 (621, 0, 3, 'Mr. Henry Damsgaard Hansen', 'male', 21.0, 0, 0, 7.8542),
 (622, 0, 3, 'Mr. David John Bowen', 'male', 21.0, 0, 0, 16.1),
 (623, 0, 1, 'Mr. Frederick Sutton', 'male', 61.0, 0, 0, 32.3208),
 (624, 0, 2, 'Rev. Charles Leonard Kirkland', 'male', 57.0, 0, 0, 12.35),
 (625, 1, 1, 'Miss. Gretchen Fiske Longley', 'female', 21.0, 0, 0, 77.9583),
 (626, 0, 3, 'Mr. Guentcho Bostandyeff', 'male', 26.0, 0, 0, 7.8958),
 (627, 0, 3, 'Mr. Patrick D OConnell', 'male', 18.0, 0, 0, 7.7333),
 (628, 1, 1, 'Mr. Algernon Henry Wilson Barkworth', 'male', 80.0, 0, 0, 30.0),
 (629, 0, 3, 'Mr. Johan Svensson Lundahl', 'male', 51.0, 0, 0, 7.0542),
 (630, 1, 1, 'Dr. Max Stahelin-Maeglin', 'male', 32.0, 0, 0, 30.5),
 (631, 0, 1, 'Mr. William Henry Marsh Parr', 'male', 30.0, 0, 0, 0.0),
 (632, 0, 3, 'Miss. Mabel Skoog', 'female', 9.0, 3, 2, 27.9),
 (633, 1, 2, 'Miss. Mary Davis', 'female', 28.0, 0, 0, 13.0),
 (634, 0, 3, 'Mr. Antti Gustaf Leinonen', 'male', 32.0, 0, 0, 7.925),
 (635, 0, 2, 'Mr. Harvey Collyer', 'male', 31.0, 1, 1, 26.25),
 (636,
  0,
  3,
  'Mrs. Juha (Maria Emilia Ojala) Panula',
  'female',
  41.0,
  0,
  5,
  39.6875),
 (637, 0, 3, 'Mr. Percival Thorneycroft', 'male', 37.0, 1, 0, 16.1),
 (638, 0, 3, 'Mr. Hans Peder Jensen', 'male', 20.0, 0, 0, 7.8542),
 (639, 1, 1, 'Mlle. Emma Sagesser', 'female', 24.0, 0, 0, 69.3),
 (640, 0, 3, 'Miss. Margit Elizabeth Skoog', 'female', 2.0, 3, 2, 27.9),
 (641, 1, 3, 'Mr. Choong Foo', 'male', 32.0, 0, 0, 56.4958),
 (642, 1, 3, 'Miss. Eugenie Baclini', 'female', 0.75, 2, 1, 19.2583),
 (643, 1, 1, 'Mr. Henry Sleeper Harper', 'male', 48.0, 1, 0, 76.7292),
 (644, 0, 3, 'Mr. Liudevit Cor', 'male', 19.0, 0, 0, 7.8958),
 (645, 1, 1, 'Col. Oberst Alfons Simonius-Blumer', 'male', 56.0, 0, 0, 35.5),
 (646, 0, 3, 'Mr. Edward Willey', 'male', 21.0, 0, 0, 7.55),
 (647, 1, 3, 'Miss. Amy Zillah Elsie Stanley', 'female', 23.0, 0, 0, 7.55),
 (648, 0, 3, 'Mr. Mito Mitkoff', 'male', 23.0, 0, 0, 7.8958),
 (649, 1, 2, 'Miss. Elsie Doling', 'female', 18.0, 0, 1, 23.0),
 (650, 0, 3, 'Mr. Johannes Halvorsen Kalvik', 'male', 21.0, 0, 0, 8.4333),
 (651, 1, 3, 'Miss. Hanora OLeary', 'female', 16.0, 0, 0, 7.8292),
 (652, 0, 3, 'Miss. Hanora Hegarty', 'female', 18.0, 0, 0, 6.75),
 (653, 0, 2, 'Mr. Leonard Mark Hickman', 'male', 24.0, 2, 0, 73.5),
 (654, 0, 3, 'Mr. Alexander Radeff', 'male', 27.0, 0, 0, 7.8958),
 (655, 0, 3, 'Mrs. John (Catherine) Bourke', 'female', 32.0, 1, 1, 15.5),
 (656, 0, 2, 'Mr. George Floyd Eitemiller', 'male', 23.0, 0, 0, 13.0),
 (657, 0, 1, 'Mr. Arthur Webster Newell', 'male', 58.0, 0, 2, 113.275),
 (658, 1, 1, 'Dr. Henry William Frauenthal', 'male', 50.0, 2, 0, 133.65),
 (659, 0, 3, 'Mr. Mohamed Badt', 'male', 40.0, 0, 0, 7.225),
 (660, 0, 1, 'Mr. Edward Pomeroy Colley', 'male', 47.0, 0, 0, 25.5875),
 (661, 0, 3, 'Mr. Peju Coleff', 'male', 36.0, 0, 0, 7.4958),
 (662, 1, 3, 'Mr. Eino William Lindqvist', 'male', 20.0, 1, 0, 7.925),
 (663, 0, 2, 'Mr. Lewis Hickman', 'male', 32.0, 2, 0, 73.5),
 (664, 0, 2, 'Mr. Reginald Fenton Butler', 'male', 25.0, 0, 0, 13.0),
 (665, 0, 3, 'Mr. Knud Paust Rommetvedt', 'male', 49.0, 0, 0, 7.775),
 (666, 0, 3, 'Mr. Jacob Cook', 'male', 43.0, 0, 0, 8.05),
 (667,
  1,
  1,
  'Mrs. Elmer Zebley (Juliet Cummins Wright) Taylor',
  'female',
  48.0,
  1,
  0,
  52.0),
 (668,
  1,
  2,
  'Mrs. Thomas William Solomon (Elizabeth Catherine Ford) Brown',
  'female',
  40.0,
  1,
  1,
  39.0),
 (669, 0, 1, 'Mr. Thornton Davidson', 'male', 31.0, 1, 0, 52.0),
 (670, 0, 2, 'Mr. Henry Michael Mitchell', 'male', 70.0, 0, 0, 10.5),
 (671, 1, 2, 'Mr. Charles Wilhelms', 'male', 31.0, 0, 0, 13.0),
 (672, 0, 2, 'Mr. Ennis Hastings Watson', 'male', 19.0, 0, 0, 0.0),
 (673, 0, 3, 'Mr. Gustaf Hjalmar Edvardsson', 'male', 18.0, 0, 0, 7.775),
 (674, 0, 3, 'Mr. Frederick Charles Sawyer', 'male', 24.5, 0, 0, 8.05),
 (675, 1, 3, 'Miss. Anna Sofia Turja', 'female', 18.0, 0, 0, 9.8417),
 (676,
  0,
  3,
  'Mrs. Frederick (Augusta Tyler) Goodwin',
  'female',
  43.0,
  1,
  6,
  46.9),
 (677, 1, 1, 'Mr. Thomas Drake Martinez Cardeza', 'male', 36.0, 0, 1, 512.329),
 (678, 0, 3, 'Miss. Katie Peters', 'female', 28.0, 0, 0, 8.1375),
 (679, 1, 1, 'Mr. Hammad Hassab', 'male', 27.0, 0, 0, 76.7292),
 (680, 0, 3, 'Mr. Thor Anderson Olsvigen', 'male', 20.0, 0, 0, 9.225),
 (681, 0, 3, 'Mr. Charles Edward Goodwin', 'male', 14.0, 5, 2, 46.9),
 (682, 0, 2, 'Mr. Thomas William Solomon Brown', 'male', 60.0, 1, 1, 39.0),
 (683,
  0,
  2,
  'Mr. Joseph Philippe Lemercier Laroche',
  'male',
  25.0,
  1,
  2,
  41.5792),
 (684, 0, 3, 'Mr. Jaako Arnold Panula', 'male', 14.0, 4, 1, 39.6875),
 (685, 0, 3, 'Mr. Branko Dakic', 'male', 19.0, 0, 0, 10.1708),
 (686, 0, 3, 'Mr. Eberhard Thelander Fischer', 'male', 18.0, 0, 0, 7.7958),
 (687,
  1,
  1,
  'Miss. Georgette Alexandra Madill',
  'female',
  15.0,
  0,
  1,
  211.337),
 (688, 1, 1, 'Mr. Albert Adrian Dick', 'male', 31.0, 1, 0, 57.0),
 (689, 1, 3, 'Miss. Manca Karun', 'female', 4.0, 0, 1, 13.4167),
 (690, 1, 3, 'Mr. Ali Lam', 'male', 37.0, 0, 0, 56.4958),
 (691, 0, 3, 'Mr. Khalil Saad', 'male', 25.0, 0, 0, 7.225),
 (692, 0, 1, 'Col. John Weir', 'male', 60.0, 0, 0, 26.55),
 (693, 0, 2, 'Mr. Charles Henry Chapman', 'male', 52.0, 0, 0, 13.5),
 (694, 0, 3, 'Mr. James Kelly', 'male', 44.0, 0, 0, 8.05),
 (695, 1, 3, 'Miss. Katherine Mullens', 'female', 19.0, 0, 0, 7.7333),
 (696, 0, 1, 'Mr. John Borland Thayer', 'male', 49.0, 1, 1, 110.883),
 (697,
  0,
  3,
  'Mr. Adolf Mathias Nicolai Olsen Humblen',
  'male',
  42.0,
  0,
  0,
  7.65),
 (698,
  1,
  1,
  'Mrs. John Jacob (Madeleine Talmadge Force) Astor',
  'female',
  18.0,
  1,
  0,
  227.525),
 (699, 1, 1, 'Mr. Spencer Victor Silverthorne', 'male', 35.0, 0, 0, 26.2875),
 (700, 0, 3, 'Miss. Saiide Barbara', 'female', 18.0, 0, 1, 14.4542),
 (701, 0, 3, 'Mr. Martin Gallagher', 'male', 25.0, 0, 0, 7.7417),
 (702, 0, 3, 'Mr. Henrik Juul Hansen', 'male', 26.0, 1, 0, 7.8542),
 (703, 0, 2, 'Mr. Henry Samuel Morley', 'male', 39.0, 0, 0, 26.0),
 (704, 1, 2, 'Mrs. Florence Kelly', 'female', 45.0, 0, 0, 13.5),
 (705, 1, 1, 'Mr. Edward Pennington Calderhead', 'male', 42.0, 0, 0, 26.2875),
 (706, 1, 1, 'Miss. Alice Cleaver', 'female', 22.0, 0, 0, 151.55),
 (707, 1, 3, 'Master. Halim Gonios Moubarek', 'male', 4.0, 1, 1, 15.2458),
 (708, 1, 1, 'Mlle. Berthe Antonine Mayne', 'female', 24.0, 0, 0, 49.5042),
 (709, 0, 1, 'Mr. Herman Klaber', 'male', 41.0, 0, 0, 26.55),
 (710, 1, 1, 'Mr. Elmer Zebley Taylor', 'male', 48.0, 1, 0, 52.0),
 (711, 0, 3, 'Mr. August Viktor Larsson', 'male', 29.0, 0, 0, 9.4833),
 (712, 0, 2, 'Mr. Samuel Greenberg', 'male', 52.0, 0, 0, 13.0),
 (713,
  0,
  3,
  'Mr. Peter Andreas Lauritz Andersen Soholt',
  'male',
  19.0,
  0,
  0,
  7.65),
 (714, 1, 1, 'Miss. Caroline Louise Endres', 'female', 38.0, 0, 0, 227.525),
 (715, 1, 2, 'Miss. Edwina Celia Troutt', 'female', 27.0, 0, 0, 10.5),
 (716, 0, 3, 'Mr. Malkolm Joackim Johnson', 'male', 33.0, 0, 0, 7.775),
 (717, 1, 2, 'Miss. Annie Jessie Harper', 'female', 6.0, 0, 1, 33.0),
 (718, 0, 3, 'Mr. Svend Lauritz Jensen', 'male', 17.0, 1, 0, 7.0542),
 (719, 0, 2, 'Mr. William Henry Gillespie', 'male', 34.0, 0, 0, 13.0),
 (720, 0, 2, 'Mr. Henry Price Hodges', 'male', 50.0, 0, 0, 13.0),
 (721, 1, 1, 'Mr. Norman Campbell Chambers', 'male', 27.0, 1, 0, 53.1),
 (722, 0, 3, 'Mr. Luka Oreskovic', 'male', 20.0, 0, 0, 8.6625),
 (723,
  1,
  2,
  'Mrs. Peter Henry (Lillian Jefferys) Renouf',
  'female',
  30.0,
  3,
  0,
  21.0),
 (724, 1, 3, 'Miss. Margareth Mannion', 'female', 28.0, 0, 0, 7.7375),
 (725, 0, 2, 'Mr. Kurt Arnold Gottfrid Bryhl', 'male', 25.0, 1, 0, 26.0),
 (726, 0, 3, 'Miss. Pieta Sofia Ilmakangas', 'female', 25.0, 1, 0, 7.925),
 (727, 1, 1, 'Miss. Elisabeth Walton Allen', 'female', 29.0, 0, 0, 211.337),
 (728, 0, 3, 'Mr. Houssein G N Hassan', 'male', 11.0, 0, 0, 18.7875),
 (729, 0, 2, 'Mr. Robert J Knight', 'male', 41.0, 0, 0, 0.0),
 (730, 0, 2, 'Mr. William John Berriman', 'male', 23.0, 0, 0, 13.0),
 (731, 0, 2, 'Mr. Moses Aaron Troupiansky', 'male', 23.0, 0, 0, 13.0),
 (732, 0, 3, 'Mr. Leslie Williams', 'male', 28.5, 0, 0, 16.1),
 (733,
  0,
  3,
  'Mrs. Edward (Margaret Ann Watson) Ford',
  'female',
  48.0,
  1,
  3,
  34.375),
 (734, 1, 1, 'Mr. Gustave J Lesurer', 'male', 35.0, 0, 0, 512.329),
 (735, 0, 3, 'Mr. Kanio Ivanoff', 'male', 20.0, 0, 0, 7.8958),
 (736, 0, 3, 'Mr. Minko Nankoff', 'male', 32.0, 0, 0, 7.8958),
 (737, 1, 1, 'Mr. Walter James Hawksford', 'male', 45.0, 0, 0, 30.0),
 (738, 0, 1, 'Mr. Tyrell William Cavendish', 'male', 36.0, 1, 0, 78.85),
 (739, 1, 1, 'Miss. Susan Parker Ryerson', 'female', 21.0, 2, 2, 262.375),
 (740, 0, 3, 'Mr. Neal McNamee', 'male', 24.0, 1, 0, 16.1),
 (741, 1, 3, 'Mr. Juho Stranden', 'male', 31.0, 0, 0, 7.925),
 (742, 0, 1, 'Capt. Edward Gifford Crosby', 'male', 70.0, 1, 1, 71.0),
 (743, 0, 3, 'Mr. Rossmore Edward Abbott', 'male', 16.0, 1, 1, 20.25),
 (744, 1, 2, 'Miss. Anna Sinkkonen', 'female', 30.0, 0, 0, 13.0),
 (745, 0, 1, 'Mr. Daniel Warner Marvin', 'male', 19.0, 1, 0, 53.1),
 (746, 0, 3, 'Mr. Michael Connaghton', 'male', 31.0, 0, 0, 7.75),
 (747, 1, 2, 'Miss. Joan Wells', 'female', 4.0, 1, 1, 23.0),
 (748, 1, 3, 'Master. Meier Moor', 'male', 6.0, 0, 1, 12.475),
 (749, 0, 3, 'Mr. Johannes Joseph Vande Velde', 'male', 33.0, 0, 0, 9.5),
 (750, 0, 3, 'Mr. Lalio Jonkoff', 'male', 23.0, 0, 0, 7.8958),
 (751, 1, 2, 'Mrs. Samuel (Jane Laver) Herman', 'female', 48.0, 1, 2, 65.0),
 (752, 1, 2, 'Master. Viljo Hamalainen', 'male', 0.67, 1, 1, 14.5),
 (753, 0, 3, 'Mr. August Sigfrid Carlsson', 'male', 28.0, 0, 0, 7.7958),
 (754, 0, 2, 'Mr. Percy Andrew Bailey', 'male', 18.0, 0, 0, 11.5),
 (755, 0, 3, 'Mr. Thomas Leonard Theobald', 'male', 34.0, 0, 0, 8.05),
 (756,
  1,
  1,
  'the Countess. of (Lucy Noel Martha Dyer-Edwards) Rothes',
  'female',
  33.0,
  0,
  0,
  86.5),
 (757, 0, 3, 'Mr. John Garfirth', 'male', 23.0, 0, 0, 14.5),
 (758, 0, 3, 'Mr. Iisakki Antino Aijo Nirva', 'male', 41.0, 0, 0, 7.125),
 (759, 1, 3, 'Mr. Hanna Assi Barah', 'male', 20.0, 0, 0, 7.2292),
 (760,
  1,
  1,
  'Mrs. William Ernest (Lucile Polk) Carter',
  'female',
  36.0,
  1,
  2,
  120.0),
 (761, 0, 3, 'Mr. Hans Linus Eklund', 'male', 16.0, 0, 0, 7.775),
 (762,
  1,
  1,
  'Mrs. John C (Anna Andrews) Hogeboom',
  'female',
  51.0,
  1,
  0,
  77.9583),
 (763, 0, 1, 'Dr. Arthur Jackson Brewe', 'male', 46.0, 0, 0, 39.6),
 (764, 0, 3, 'Miss. Mary Mangan', 'female', 30.5, 0, 0, 7.75),
 (765, 0, 3, 'Mr. Daniel J Moran', 'male', 28.0, 1, 0, 24.15),
 (766, 0, 3, 'Mr. Daniel Danielsen Gronnestad', 'male', 32.0, 0, 0, 8.3625),
 (767, 0, 3, 'Mr. Rene Aime Lievens', 'male', 24.0, 0, 0, 9.5),
 (768, 0, 3, 'Mr. Niels Peder Jensen', 'male', 48.0, 0, 0, 7.8542),
 (769, 0, 2, 'Mrs. (Mary) Mack', 'female', 57.0, 0, 0, 10.5),
 (770, 0, 3, 'Mr. Dibo Elias', 'male', 29.0, 0, 0, 7.225),
 (771,
  1,
  2,
  'Mrs. Elizabeth (Eliza Needs) Hocking',
  'female',
  54.0,
  1,
  3,
  23.0),
 (772,
  0,
  3,
  'Mr. Pehr Fabian Oliver Malkolm Myhrman',
  'male',
  18.0,
  0,
  0,
  7.75),
 (773, 0, 3, 'Mr. Roger Tobin', 'male', 20.0, 0, 0, 7.75),
 (774, 1, 3, 'Miss. Virginia Ethel Emanuel', 'female', 5.0, 0, 0, 12.475),
 (775, 0, 3, 'Mr. Thomas J Kilgannon', 'male', 22.0, 0, 0, 7.7375),
 (776,
  1,
  1,
  'Mrs. Edward Scott (Elisabeth Walton McMillan) Robert',
  'female',
  43.0,
  0,
  1,
  211.337),
 (777, 1, 3, 'Miss. Banoura Ayoub', 'female', 13.0, 0, 0, 7.2292),
 (778,
  1,
  1,
  'Mrs. Albert Adrian (Vera Gillespie) Dick',
  'female',
  17.0,
  1,
  0,
  57.0),
 (779, 0, 1, 'Mr. Milton Clyde Long', 'male', 29.0, 0, 0, 30.0),
 (780, 0, 3, 'Mr. Andrew G Johnston', 'male', 35.0, 1, 2, 23.45),
 (781, 0, 3, 'Mr. William Ali', 'male', 25.0, 0, 0, 7.05),
 (782, 0, 3, 'Mr. Abraham (David Lishin) Harmer', 'male', 25.0, 0, 0, 7.25),
 (783, 1, 3, 'Miss. Anna Sofia Sjoblom', 'female', 18.0, 0, 0, 7.4958),
 (784, 0, 3, 'Master. George Hugh Rice', 'male', 8.0, 4, 1, 29.125),
 (785, 1, 3, 'Master. Bertram Vere Dean', 'male', 1.0, 1, 2, 20.575),
 (786, 0, 1, 'Mr. Benjamin Guggenheim', 'male', 46.0, 0, 0, 79.2),
 (787, 0, 3, 'Mr. Andrew Keane', 'male', 20.0, 0, 0, 7.75),
 (788, 0, 2, 'Mr. Alfred Gaskell', 'male', 16.0, 0, 0, 26.0),
 (789, 0, 3, 'Miss. Stella Anna Sage', 'female', 21.0, 8, 2, 69.55),
 (790, 0, 1, 'Mr. William Fisher Hoyt', 'male', 43.0, 0, 0, 30.6958),
 (791, 0, 3, 'Mr. Ristiu Dantcheff', 'male', 25.0, 0, 0, 7.8958),
 (792, 0, 2, 'Mr. Richard Otter', 'male', 39.0, 0, 0, 13.0),
 (793, 1, 1, 'Dr. Alice (Farnham) Leader', 'female', 49.0, 0, 0, 25.9292),
 (794, 1, 3, 'Mrs. Mara Osman', 'female', 31.0, 0, 0, 8.6833),
 (795, 0, 3, 'Mr. Yousseff Ibrahim Shawah', 'male', 30.0, 0, 0, 7.2292),
 (796,
  0,
  3,
  'Mrs. Jean Baptiste (Rosalie Paula Govaert) Van Impe',
  'female',
  30.0,
  1,
  1,
  24.15),
 (797, 0, 2, 'Mr. Martin Ponesell', 'male', 34.0, 0, 0, 13.0),
 (798,
  1,
  2,
  'Mrs. Harvey (Charlotte Annie Tate) Collyer',
  'female',
  31.0,
  1,
  1,
  26.25),
 (799, 1, 1, 'Master. William Thornton II Carter', 'male', 11.0, 1, 2, 120.0),
 (800, 1, 3, 'Master. Assad Alexander Thomas', 'male', 0.42, 0, 1, 8.5167),
 (801, 1, 3, 'Mr. Oskar Arvid Hedman', 'male', 27.0, 0, 0, 6.975),
 (802, 0, 3, 'Mr. Karl Johan Johansson', 'male', 31.0, 0, 0, 7.775),
 (803, 0, 1, 'Mr. Thomas Jr Andrews', 'male', 39.0, 0, 0, 0.0),
 (804, 0, 3, 'Miss. Ellen Natalia Pettersson', 'female', 18.0, 0, 0, 7.775),
 (805, 0, 2, 'Mr. August Meyer', 'male', 39.0, 0, 0, 13.0),
 (806,
  1,
  1,
  'Mrs. Norman Campbell (Bertha Griggs) Chambers',
  'female',
  33.0,
  1,
  0,
  53.1),
 (807, 0, 3, 'Mr. William Alexander', 'male', 26.0, 0, 0, 7.8875),
 (808, 0, 3, 'Mr. James Lester', 'male', 39.0, 0, 0, 24.15),
 (809, 0, 2, 'Mr. Richard James Slemen', 'male', 35.0, 0, 0, 10.5),
 (810, 0, 3, 'Miss. Ebba Iris Alfrida Andersson', 'female', 6.0, 4, 2, 31.275),
 (811, 0, 3, 'Mr. Ernest Portage Tomlin', 'male', 30.5, 0, 0, 8.05),
 (812, 0, 1, 'Mr. Richard Fry', 'male', 39.0, 0, 0, 0.0),
 (813, 0, 3, 'Miss. Wendla Maria Heininen', 'female', 23.0, 0, 0, 7.925),
 (814, 0, 2, 'Mr. Albert Mallet', 'male', 31.0, 1, 1, 37.0042),
 (815, 0, 3, 'Mr. John Fredrik Alexander Holm', 'male', 43.0, 0, 0, 6.45),
 (816, 0, 3, 'Master. Karl Thorsten Skoog', 'male', 10.0, 3, 2, 27.9),
 (817,
  1,
  1,
  'Mrs. Charles Melville (Clara Jennings Gregg) Hays',
  'female',
  52.0,
  1,
  1,
  93.5),
 (818, 1, 3, 'Mr. Nikola Lulic', 'male', 27.0, 0, 0, 8.6625),
 (819, 0, 1, 'Jonkheer. John George Reuchlin', 'male', 38.0, 0, 0, 0.0),
 (820, 1, 3, 'Mrs. (Beila) Moor', 'female', 27.0, 0, 1, 12.475),
 (821, 0, 3, 'Master. Urho Abraham Panula', 'male', 2.0, 4, 1, 39.6875),
 (822, 0, 3, 'Mr. John Flynn', 'male', 36.0, 0, 0, 6.95),
 (823, 0, 3, 'Mr. Len Lam', 'male', 23.0, 0, 0, 56.4958),
 (824, 1, 2, 'Master. Andre Mallet', 'male', 1.0, 0, 2, 37.0042),
 (825, 1, 3, 'Mr. Thomas Joseph McCormack', 'male', 19.0, 0, 0, 7.75),
 (826,
  1,
  1,
  'Mrs. George Nelson (Martha Evelyn) Stone',
  'female',
  62.0,
  0,
  0,
  80.0),
 (827,
  1,
  3,
  'Mrs. Antoni (Selini Alexander) Yasbeck',
  'female',
  15.0,
  1,
  0,
  14.4542),
 (828, 1, 2, 'Master. George Sibley Richards', 'male', 0.83, 1, 1, 18.75),
 (829, 0, 3, 'Mr. Amin Saad', 'male', 30.0, 0, 0, 7.2292),
 (830, 0, 3, 'Mr. Albert Augustsson', 'male', 23.0, 0, 0, 7.8542),
 (831, 0, 3, 'Mr. Owen George Allum', 'male', 18.0, 0, 0, 8.3),
 (832, 1, 1, 'Miss. Sara Rebecca Compton', 'female', 39.0, 1, 1, 83.1583),
 (833, 0, 3, 'Mr. Jakob Pasic', 'male', 21.0, 0, 0, 8.6625),
 (834, 0, 3, 'Mr. Maurice Sirota', 'male', 20.0, 0, 0, 8.05),
 (835, 1, 3, 'Mr. Chang Chip', 'male', 32.0, 0, 0, 56.4958),
 (836, 1, 1, 'Mr. Pierre Marechal', 'male', 29.0, 0, 0, 29.7),
 (837, 0, 3, 'Mr. Ilmari Rudolf Alhomaki', 'male', 20.0, 0, 0, 7.925),
 (838, 0, 2, 'Mr. Thomas Charles Mudd', 'male', 16.0, 0, 0, 10.5),
 (839, 1, 1, 'Miss. Augusta Serepeca', 'female', 30.0, 0, 0, 31.0),
 (840, 0, 3, 'Mr. Peter L Lemberopolous', 'male', 34.5, 0, 0, 6.4375),
 (841, 0, 3, 'Mr. Jeso Culumovic', 'male', 17.0, 0, 0, 8.6625),
 (842, 0, 3, 'Mr. Anthony Abbing', 'male', 42.0, 0, 0, 7.55),
 (843, 0, 3, 'Mr. Douglas Bullen Sage', 'male', 18.0, 8, 2, 69.55),
 (844, 0, 3, 'Mr. Marin Markoff', 'male', 35.0, 0, 0, 7.8958),
 (845, 0, 2, 'Rev. John Harper', 'male', 28.0, 0, 1, 33.0),
 (846,
  1,
  1,
  'Mrs. Samuel L (Edwiga Grabowska) Goldenberg',
  'female',
  40.0,
  1,
  0,
  89.1042),
 (847,
  0,
  3,
  'Master. Sigvard Harald Elias Andersson',
  'male',
  4.0,
  4,
  2,
  31.275),
 (848, 0, 3, 'Mr. Johan Svensson', 'male', 74.0, 0, 0, 7.775),
 (849, 0, 3, 'Miss. Nourelain Boulos', 'female', 9.0, 1, 1, 15.2458),
 (850, 1, 1, 'Miss. Mary Conover Lines', 'female', 16.0, 0, 1, 39.4),
 (851,
  0,
  2,
  'Mrs. Ernest Courtenay (Lilian Hughes) Carter',
  'female',
  44.0,
  1,
  0,
  26.0),
 (852, 1, 3, 'Mrs. Sam (Leah Rosen) Aks', 'female', 18.0, 0, 1, 9.35),
 (853,
  1,
  1,
  'Mrs. George Dennick (Mary Hitchcock) Wick',
  'female',
  45.0,
  1,
  1,
  164.867),
 (854, 1, 1, 'Mr. Peter Denis Daly', 'male', 51.0, 0, 0, 26.55),
 (855,
  1,
  3,
  'Mrs. Solomon (Latifa Qurban) Baclini',
  'female',
  24.0,
  0,
  3,
  19.2583),
 (856, 0, 3, 'Mr. Raihed Razi', 'male', 30.0, 0, 0, 7.2292),
 (857, 0, 3, 'Mr. Claus Peter Hansen', 'male', 41.0, 2, 0, 14.1083),
 (858, 0, 2, 'Mr. Frederick Edward Giles', 'male', 21.0, 1, 0, 11.5),
 (859,
  1,
  1,
  'Mrs. Frederick Joel (Margaret Welles Barron) Swift',
  'female',
  48.0,
  0,
  0,
  25.9292),
 (860, 0, 3, 'Miss. Dorothy Edith Sage', 'female', 14.0, 8, 2, 69.55),
 (861, 0, 2, 'Mr. John William Gill', 'male', 24.0, 0, 0, 13.0),
 (862, 1, 2, 'Mrs. (Karolina) Bystrom', 'female', 42.0, 0, 0, 13.0),
 (863, 1, 2, 'Miss. Asuncion Duran y More', 'female', 27.0, 1, 0, 13.8583),
 (864,
  0,
  1,
  'Mr. Washington Augustus II Roebling',
  'male',
  31.0,
  0,
  0,
  50.4958),
 (865, 0, 3, 'Mr. Philemon van Melkebeke', 'male', 23.0, 0, 0, 9.5),
 (866, 1, 3, 'Master. Harold Theodor Johnson', 'male', 4.0, 1, 1, 11.1333),
 (867, 0, 3, 'Mr. Cerin Balkic', 'male', 26.0, 0, 0, 7.8958),
 (868,
  1,
  1,
  'Mrs. Richard Leonard (Sallie Monypeny) Beckwith',
  'female',
  47.0,
  1,
  1,
  52.5542),
 (869, 0, 1, 'Mr. Frans Olof Carlsson', 'male', 33.0, 0, 0, 5.0),
 (870, 0, 3, 'Mr. Victor Vander Cruyssen', 'male', 47.0, 0, 0, 9.0),
 (871,
  1,
  2,
  'Mrs. Samuel (Hannah Wizosky) Abelson',
  'female',
  28.0,
  1,
  0,
  24.0),
 (872, 1, 3, 'Miss. Adele Kiamie Najib', 'female', 15.0, 0, 0, 7.225),
 (873, 0, 3, 'Mr. Alfred Ossian Gustafsson', 'male', 20.0, 0, 0, 9.8458),
 (874, 0, 3, 'Mr. Nedelio Petroff', 'male', 19.0, 0, 0, 7.8958),
 (875, 0, 3, 'Mr. Kristo Laleff', 'male', 23.0, 0, 0, 7.8958),
 (876,
  1,
  1,
  'Mrs. Thomas Jr (Lily Alexenia Wilson) Potter',
  'female',
  56.0,
  0,
  1,
  83.1583),
 (877,
  1,
  2,
  'Mrs. William (Imanita Parrish Hall) Shelley',
  'female',
  25.0,
  0,
  1,
  26.0),
 (878, 0, 3, 'Mr. Johann Markun', 'male', 33.0, 0, 0, 7.8958),
 (879, 0, 3, 'Miss. Gerda Ulrika Dahlberg', 'female', 22.0, 0, 0, 10.5167),
 (880, 0, 2, 'Mr. Frederick James Banfield', 'male', 28.0, 0, 0, 10.5),
 (881, 0, 3, 'Mr. Henry Jr Sutehall', 'male', 25.0, 0, 0, 7.05),
 (882,
  0,
  3,
  'Mrs. William (Margaret Norton) Rice',
  'female',
  39.0,
  0,
  5,
  29.125),
 (883, 0, 2, 'Rev. Juozas Montvila', 'male', 27.0, 0, 0, 13.0),
 (884, 1, 1, 'Miss. Margaret Edith Graham', 'female', 19.0, 0, 0, 30.0),
 (885, 0, 3, 'Miss. Catherine Helen Johnston', 'female', 7.0, 1, 2, 23.45),
 (886, 1, 1, 'Mr. Karl Howell Behr', 'male', 26.0, 0, 0, 30.0),
 (887, 0, 3, 'Mr. Patrick Dooley', 'male', 32.0, 0, 0, 7.75)]

In [32]:
pg_curs.close()
pg_conn.commit()